Revit 2027 API
DistributionSysTypeSet.Insert Method
Insert the specified DistributionSys type into the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	DistributionSysType item
)
Public Overridable Function Insert (
	item As DistributionSysType
) As Boolean
public:
virtual bool Insert(
	DistributionSysType^ item
)
abstract Insert :
        item : DistributionSysType -> bool
override Insert :
        item : DistributionSysType -> bool
Parameters
item DistributionSysType
The DistributionSys type to be inserted into the set.
Return Value
Boolean
Returns whether the DistributionSys type was inserted into the set.
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace